eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
void RTC_IRAM_ATTR esp_wake_deep_sleep() {
  esp_default_wake_deep_sleep();
  laserActive = true;
  relayActive = true;
  digitalWrite(outputPin, HIGH);
  digitalWrite(relayPin, HIGH);
}

/**
 * @brief Generates a unique device ID from the ESP32's MAC address.
 * @return A String representing the unique chip ID.
 */
String getChipId() {
    uint64_t chipid = ESP.getEfuseMac();
    char chipid_str[17];
    snprintf(chipid_str, sizeof(chipid_str), "%04X%08X", (uint16_t)(chipid >> 32), (uint32_t)chipid);
    return String(chipid_str);
}

/**
 * @brief Handles events from the WebSocket client.
 *
 * This function is called by the WebSocketsClient library when various events occur,
 * such as connection, disconnection, or when a message is received.
 *
 * @param type The type of WebSocket event that occurred.
 * @param payload A pointer to the data payload associated with the event (if any).
 * @param length The length of the payload.
 */
void webSocketEvent(WStype_t type, uint8_t * payload, size_t length) {
    switch(type) {
        case WStype_DISCONNECTED:
            Serial.printf("[WSc] Disconnected!\n");
            webSocketConnected = false;
            break;
        case WStype_CONNECTED:
            Serial.printf("[WSc] Connected to url: %s\n", (char*)payload);
            webSocketConnected = true;
            // Send pairing message
            {
                StaticJsonDocument<200> doc;
                doc["type"] = "pairing";
                doc["deviceId"] = deviceId;
                String output;
                serializeJson(doc, output);
                webSocket.sendTXT(output);
                Serial.println("Sent pairing message: " + output);
            }
            break;
        case WStype_TEXT:
            Serial.printf("[WSc] get text: %s\n", (char*)payload);
            // Parse JSON command from server
            {
                StaticJsonDocument<256> doc; // Adjust size as needed
                DeserializationError error = deserializeJson(doc, payload, length);
                if (error) {
                    Serial.print(F("deserializeJson() failed: "));
                    Serial.println(error.f_str());
                    return;
                }

                const char* command = doc["command"]; // e.g., "servoX", "ledOn"

                if (strcmp(command, "servoX") == 0) {
                    int val = doc["value"];
                    myservoX.write(val);
                    valueStringX = String(val); // Update for display if any part of OLED remains
                    Serial.printf("Executed servoX: %d\n", val);
                    // Optionally send back a status update
                } else if (strcmp(command, "servoY") == 0) {
                    int val = doc["value"];
                    myservoY.write(val);
                    valueStringY = String(val);
                    Serial.printf("Executed servoY: %d\n", val);
                } else if (strcmp(command, "LASER_ON") == 0) {
                    turnLaserOn();
                    Serial.println("Executed LASER_ON");
                } else if (strcmp(command, "LASER_OFF") == 0) {
                    turnLaserOff();
                    Serial.println("Executed LASER_OFF");
                } else if (strcmp(command, "RELAY_ON") == 0) {
                    digitalWrite(relayPin, HIGH);
                    relayActive = true;
                    Serial.println("Executed RELAY_ON");
                } else if (strcmp(command, "RELAY_OFF") == 0) {
                    digitalWrite(relayPin, LOW);
                    relayActive = false;
                    Serial.println("Executed RELAY_OFF");
                } else if (strcmp(command, "RANDOM_MOTION_TOGGLE") == 0) {
                    randomMotionActive = !randomMotionActive;
                     Serial.printf("Random motion toggled: %s\n", randomMotionActive ? "ON" : "OFF");
                }
                // Commands for ESP32CAM
                else if (strcmp(command, "START_STREAM") == 0) {
                    Serial2.println("START_STREAM");
                    Serial.println("Sent command to ESP32CAM: START_STREAM");
                    streaming = true;
                } else if (strcmp(command, "STOP_STREAM") == 0) {
                    Serial2.println("STOP_STREAM");
                    Serial.println("Sent command to ESP32CAM: STOP_STREAM");
                    streaming = false;
                } else if (strcmp(command, "CAM_LED_ON") == 0) {
                    Serial2.println("LED_ON");
                    Serial.println("Sent command to ESP32CAM: LED_ON");
                } else if (strcmp(command, "CAM_LED_OFF") == 0) {
                    Serial2.println("LED_OFF");
                    Serial.println("Sent command to ESP32CAM: LED_OFF");
                }
                // Add more command handlers as needed
            }
            break;
        case WStype_BIN:
            Serial.printf("[WSc] get binary length: %u\n", length);
            // hexdump(payload, length); // Example: webSocket.sendBIN(payload, length);
            break;
        case WStype_ERROR:
        case WStype_FRAGMENT_TEXT_START:
        case WStype_FRAGMENT_BIN_START:
        case WStype_FRAGMENT:
        case WStype_FRAGMENT_FIN:
            break;
    }
}

void saveWifiCallback() {
  Serial.println("WiFi credentials saved");
  wifiConnectedAP = true;
  staSSID = WiFi.SSID();
  staPassword = WiFi.psk();
}

// Function to get formatted time
String getFormattedTime() {
  return timeClient.getFormattedTime();
}

int timeToMinutes(String formattedTime) {
  int hours = formattedTime.substring(0, 2).toInt();
  int minutes = formattedTime.substring(3, 5).toInt();
  return hours * 60 + minutes;
}

String minutesToTime(int totalMinutes) {
  int hours = (totalMinutes / 60) % 24;
  int minutes = totalMinutes % 60;
  return String(hours < 10 ? "0" : "") + String(hours) + ":" + String(minutes < 10 ? "0" : "") + String(minutes);
}

/** @brief Turns the laser connected to outputPin ON. */
void turnLaserOn() {
  digitalWrite(outputPin, HIGH);
}

/** @brief Turns the laser connected to outputPin OFF. */
void turnLaserOff() {
  digitalWrite(outputPin, LOW);
}

