eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
/** @brief Displays a message on the OLED screen prompting user to connect to the WiFiManager AP. */
void displayConnectAPMessage() {
  display.clearDisplay();
  display.setTextSize(1); // Larger text size
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(0, 0);
  display.println("Connect to WiFi:");
  display.setTextSize(2);
  display.println("MiauAP");
  display.display();
}



void configModeCallback (WiFiManager *myWiFiManager) {
displayConnectAPMessage();

}

void showBongoCat(){
  display.drawBitmap(0, 0, bongocat, 128, 32, WHITE);
  display.display();
  delay(10);
  // if(digitalRead(input_left) == LOW){
    display.clearDisplay();
    display.setRotation(2);
    display.drawBitmap(0, 0, taps[0], 128, 32, WHITE);
    display.display();
    delay(300);
  // }
  // if(digitalRead(input_right) == LOW){
    display.clearDisplay();
    display.setRotation(2);
    display.drawBitmap(0, 0, taps[1], 128, 32, WHITE);
    display.display();
    delay(300);
  // }
}

/**
 * @brief Initializes the ESP32 DevKitV1 board.
 *
 * This function performs the following setup tasks:
 * - Disables the brownout detector.
 * - Initializes Serial communication (both primary and Serial2 for ESP32CAM).
 * - Generates and stores the unique device ID.
 * - Initializes I2C communication for the OLED display.
 * - Initializes the OLED display and shows a startup animation.
 * - Enables touch wakeup functionality.
 * - Loads saved configuration settings (servo limits, velocities, timezone, NTP interval, timers) from Preferences (NVS).
 * - Initializes output pins for laser and relay.
 * - Attaches and initializes servo motors to their default positions.
 * - Sets up WiFiManager for Wi-Fi connection and credential management.
 *   - If autoConnect fails, it starts a configuration portal.
 *   - On successful connection, initializes the NTP client for time synchronization.
 * - Initializes ArduinoOTA for over-the-air updates.
 * - Initializes the WebSocket client and sets up its event handler and reconnect interval.
 */
void setup() {
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0); // Disable brownout detector
  Serial.begin(115200);
  deviceId = getChipId();
  Serial.println("Device ID: " + deviceId);
  Serial2.begin(115200); // Initialize Serial2
  // Initialize I2C communication
  Wire.begin(SDA_PIN, SCL_PIN);

  // Initialize OLED display
  if(!display.begin(SSD1306_SWITCHCAPVCC, 0x3C)) { // Address 0x3C for 128x32
    Serial.println(F("SSD1306 allocation failed"));
    for(;;);
  }

  // Play the tap animation 6 times at startup
  for (int i = 0; i < 3; i++) {
showBongoCat();
  }

  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(0, 0);
  display.print("Connecting to Wi-Fi..");
  display.display();

  touchSleepWakeUpEnable(T9, 75); // Enable touch wakeup


  preferences.begin("servo_config"); // Namespace for our preferences

  minX = preferences.getInt("min_x", 0); // Default to 0 if not found
  maxX = preferences.getInt("max_x", 180); // Default to 180 if not found
  minY = preferences.getInt("min_y", 45); // Default to 0 if not found
  maxY = preferences.getInt("max_y", 135); // Default to 180 if not found
  minVel = preferences.getInt("min_vel", 800); // Default to 800 if not found
  maxVel = preferences.getInt("max_vel", 2000); // Default to 2000 if not found
  timeZoneOffset = preferences.getInt("timezone", 2);  // Load timezone, default to 2
  ntpUpdateInterval = preferences.getLong("ntp_interval", 60 * 60 * 1000); // Load interval
  Serial.print("Loaded Timezone Offset (Preferences): ");
  Serial.println(timeZoneOffset);
  Serial.print("Loaded NTP Update Interval (Preferences): ");
  Serial.println(ntpUpdateInterval);

  Serial.print("Loaded Min Velocity (Preferences): ");
  Serial.println(minVel);
  Serial.print("Loaded Max Velocity (Preferences): ");
  Serial.println(maxVel);

  // Load the number of timers
  numTimeSlots = preferences.getInt("num_timers", 0);
  numTimeSlots = constrain(numTimeSlots, 0, MAX_TIMERS); // Ensure it's within bounds

  Serial.print("Loaded number of timers: ");
  Serial.println(numTimeSlots);

  // Load each timer
  for (int i = 0; i < numTimeSlots; i++) {
    String baseKey = "timer_" + String(i);
    timeSlots[i].startTimeMinutes = preferences.getInt((baseKey + "_start").c_str(), -1);
    timeSlots[i].stopTimeMinutes = preferences.getInt((baseKey + "_stop").c_str(), -1);
    timeSlots[i].active = false; // Initialize as not active
    Serial.printf("Loaded Timer %d: Start=%d, Stop=%d\n", i, timeSlots[i].startTimeMinutes, timeSlots[i].stopTimeMinutes);
  }
  // Set pins to output and initialize as ON
  pinMode(outputPin, OUTPUT);
  pinMode(relayPin, OUTPUT);
  turnLaserOn();
  delay(500);
  turnLaserOff();
  digitalWrite(relayPin, HIGH);
  // Calculate halfway positions
  // int initialX = (minX + maxX) / 2;
  // int initialY = (minY + maxY) / 2;
  int initialX = 90;
  int initialY = 90;

    // Initialize servo positions
  myservoX.attach(servoPinX);
  myservoY.attach(servoPinY);
  myservoX.write(initialX);
  myservoY.write(initialY);
  
    // Set initial slider values
  valueStringX = String(initialX);
  valueStringY = String(initialY);

  // wm.resetSettings(); // Reset WiFi settings
  wm.setAPCallback(configModeCallback);
  if (!wm.autoConnect("MiauAP")) {
    Serial.println("Failed to connect to WiFi");
    // displayConnectAPMessage(); // Display message on OLED
  } else {
    Serial.println("Connected to WiFi");
    wm.setShowPassword(true);
    // wm.setSaveConfigCallback(saveWifiCallback);
    wifiConnectedAP = true;
    staSSID = WiFi.SSID();
    staPassword = WiFi.psk();
    Serial.println(staSSID);
    Serial.println(staPassword);
    // Initialize NTP Client
    timeClient.begin();
    timeClient.setTimeOffset(timeZoneOffset * 3600); // Apply loaded timezone
    Serial.println("NTP Client started.");
    // Immediately try to get the time at startup
    if (!timeClient.update()) {
      Serial.println("Failed to get NTP time at startup.");
    } else {
      Serial.println("NTP time synchronized at startup.");
    }
    lastNTPUpdateTime = millis(); // Initialize the last update time
  }



  // OTA setup
  ArduinoOTA.onStart([]() {
    Serial.println("Start OTA update");
  }).onEnd([]() {
    Serial.println("OTA update complete");
  }).onError([](ota_error_t error) {
    Serial.printf("OTA Error[%u]\n", error);
  });
  ArduinoOTA.begin();

  // webSocket.begin(wsHost, wsPort, wsPath, "ws"); // For unencrypted WebSocket
  // For WSS (SSL), you might need to specify fingerprints or use setCACert
  // For now, assuming Nginx handles SSL termination and proxies to ws:// internally
  webSocket.begin(wsHost, wsPort, wsPath);
  webSocket.onEvent(webSocketEvent);
  webSocket.setReconnectInterval(5000); // Already set via const but can be set here too
  // Optional: for SSL, if your server uses a self-signed cert or you want to pin.
  // webSocket.setFingerprint("...");
}



void saveTimersToPreferences() {
  preferences.begin("servo_config"); // Begin the session here

  preferences.putInt("num_timers", numTimeSlots);
  Serial.printf("Saved num_timers: %d\n", numTimeSlots);
  Serial.printf("Read back num_timers: %d\n", preferences.getInt("num_timers", -99));

